tap "homebrew/cask"
tap "github/gh"
tap "burntsushi/ripgrep", "https://github.com/BurntSushi/ripgrep.git"
tap "homebrew/cask-fonts"
tap "heroku/brew"
cask_args appdir: "/Applications"

brew "ack"
brew "asdf"
brew "autojump"
brew "bat"
brew "brew-cask-completion"
brew "burntsushi/ripgrep/ripgrep-bin"
brew "coreutils"
brew "eslint"
brew "exercism"
brew "fzf"
brew "gh"
brew "git"
brew "gpg"
brew "heroku"
brew "mas"
brew "navi"
brew "neovim"
brew "openssl"
brew "reattach-to-user-namespace"
brew "redis"
brew "starship"
brew "tmux"
brew "yarn"
brew "zsh"
brew "zsh-completions"

cask "1password-cli"
cask "font-hack-nerd-font"
cask "github"
cask "karabiner-elements"

# First time running, uncomment these tools

# brew "postgresql"
# cask "iterm2"
# mas "Slack", id: 803453959
# mas "1Password 7", id: 1333542190
# mas "Xcode", id: 497799835
